# Определяем переменные
DOCKER_COMPOSE = docker compose

# Команда для остановки контейнеров
down:
	$(DOCKER_COMPOSE) down

# Команда для запуска контейнеров с пересборкой
up:
	$(DOCKER_COMPOSE) up --build

# Команда для выполнения обеих операций: остановка и запуск
restart: down up

# Команда для вывода доступных команд
help:
	@echo "Доступные команды:"
	@echo "  make down        - Остановить контейнеры"
	@echo "  make up          - Запустить контейнеры с пересборкой"
	@echo "  make restart      - Остановить и затем запустить контейнеры"
	@echo "  make help        - Показать эту справку"
